In [8]:
import numpy as np
import pandas as pd
print(pd.__version__)

0.24.2

In [9]:
import os
print(os.getcwd()), print()
print(os.listdir())

C:\Users\Public.DESKTOP-6RBQT7L\Desktop\Programming - Maths\SPACY IITians course

['.ipynb_checkpoints', 'Brochure Spacy Data Science Classes.pdf', 'C01L03 - Fiddling around with variables.ipynb', 'C01L07 -  Numpy-Man.ipynb', 'C01L08 - Facing off with Linear Algebra.ipynb', 'C01L09- Chug Data, Spit Frames', 'C01L10- Theatrics with dataframe', 'C01L11 - Measures of Central Tendency and Spread', 'C01L11- Measure of Central Tendency and Spread.ipynb', 'C01L14 - Boxplot etc', 'C01L14_-_Bar_Chart__Line_Plot__Scatter_plot__Boxplot_lyst8640.ipynb', 'C01L15_-_Histogram__Correlation_Heatmap__Two_way_plots.ipynb', 'Factorials_FCP_Combinations_Permutations_120515.pdf', 'Head First Python notes.txt', 'How to start Jupyter Notebook.txt', 'Math Centre PDFs', 'My questions.txt', 'Notes.txt', 'Numpy (Nikhil).ipynb', 'Numpy_Python_Cheat_Sheet.pdf', 'Pandas (Nikhil).ipynb', 'Pandas_PythonCheat_Sheet.pdf', 'Session-1 (Introduction to course - 31-Aug-2019).docx', 'SPACY Google Drive Content', 'Statistics, Matplotlib (Nikhil).ipynb', 'Untitled.ipynb', 'Untitled1.ipynb', 'Untitled2.ipynb', 'Untitled3.ipynb']

In [10]:
# S of Series to be in capital
s=pd.Series([1,2,3,4,np.nan,'nikhil','sharma','India'])
print(s, type(s))
print()
s=pd.Series([1,2,3,4,np.nan,'nikhil','sharma','India'], index = ['a','b','c','d','e','f','g','h'])
print(s), print()
print(s[0])
print(s['g'])

0         1
1         2
2         3
3         4
4       NaN
5    nikhil
6    sharma
7     India
dtype: object <class 'pandas.core.series.Series'>

a         1
b         2
c         3
d         4
e       NaN
f    nikhil
g    sharma
h     India
dtype: object

1
sharma

In [11]:
df=pd.DataFrame(np.random.randn(3,2), columns = ['A','B'], index=['x','y','z'])
print(df)
print()
data = [ ['nikhil', 10], ['ankit', 100], ['Mummy', 999], ['Papa', 999] ]
print(data, type(data))
df=pd.DataFrame(data, columns=['Name', 'Age'], index=['aa','bb','cc','dd'] )
print(df, type(df))

print()
data_array=np.array(data) # Converting 'data' list to array and then using it in a DataFrame
df2=pd.DataFrame(data_array)
print(df2, type(df2))

print() #Converting dictionary to df
data3 = { 'Name': ['Arnold', 'Ronnie', 'Jack'], 'Age':[33,55,66] }
print(type(data3))
df3=pd.DataFrame(data3)
print(df3)

          A         B
x -0.482853  1.084052
y  0.172109  0.586020
z -0.222124 -0.166943

[['nikhil', 10], ['ankit', 100], ['Mummy', 999], ['Papa', 999]] <class 'list'>
      Name  Age
aa  nikhil   10
bb   ankit  100
cc   Mummy  999
dd    Papa  999 <class 'pandas.core.frame.DataFrame'>

        0    1
0  nikhil   10
1   ankit  100
2   Mummy  999
3    Papa  999 <class 'pandas.core.frame.DataFrame'>

<class 'dict'>
     Name  Age
0  Arnold   33
1  Ronnie   55
2    Jack   66

In [12]:
data4 = {'Name': pd.Series( [1,2,3,4] ),
         'Age': pd.Series ( [55,66,77,88] ) }
df4 = pd.DataFrame (data4)
print(df4)
print("-----------------------")
# Below shows how when indexes are mismatched in DataFrame "NaN" is used as a filler
data4 = {'Name': pd.Series( [1,2,3,4], index= ['a','b','c','d'] ),
         'Age': pd.Series ( [55,66,77,88], index= ['a','b','c','e'] ) }
df4 = pd.DataFrame (data4)
print(df4)

# One more mismatch
print("-----------------------")
data5 = [ {'Name':'Arnie', 'Age':35, 'Country':'India'}, {'Name':'Billie', 'Country':'USA'} ]
print(data5, type(data5))
df5 = pd.DataFrame (data5)
print()
print(df5)

   Name  Age
0     1   55
1     2   66
2     3   77
3     4   88
-----------------------
   Name   Age
a   1.0  55.0
b   2.0  66.0
c   3.0  77.0
d   4.0   NaN
e   NaN  88.0
-----------------------
[{'Name': 'Arnie', 'Age': 35, 'Country': 'India'}, {'Name': 'Billie', 'Country': 'USA'}] <class 'list'>

    Age Country    Name
0  35.0   India   Arnie
1   NaN     USA  Billie

In [13]:
name=['nikhil','zycron']
age=[11,22,33,44,55]
c=list(zip(name,age)) # It ignores mismatched additional numbers in age
print(c, type(c))

print()
d=(name,age) #This is a tuple
print(type(d))

df=pd.DataFrame(c, columns = ['Name','Height'], index=list('ab'))
print()
print(df)

[('nikhil', 11), ('zycron', 22)] <class 'list'>

<class 'tuple'>

     Name  Height
a  nikhil      11
b  zycron      22

In [14]:
c={'Name':['a','b','c','d','e','f'], 'Age':[1,2,3,4,5,6]}
df=pd.DataFrame(c)
print(df.head()) # Prints only first top 5 rows
print()
print(df.head(2))
print()
print(df.tail(2)) # Prints only bottom x rows
print()
print(df.columns)
print()
print(df.index)
print()
print(df.info())

  Name  Age
0    a    1
1    b    2
2    c    3
3    d    4
4    e    5

  Name  Age
0    a    1
1    b    2

  Name  Age
4    e    5
5    f    6

Index(['Name', 'Age'], dtype='object')

RangeIndex(start=0, stop=6, step=1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
Name    6 non-null object
Age     6 non-null int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes
None

In [15]:
c={'Name':['a','b','c','d','e','f'], 'Age':[1,2,3,4,5,6]}
df=pd.DataFrame(c)
print(df)
print()
df1=df.rename({'Name':'Newer-Name'}, axis=1 )
print(df1) # You'd have to use print() to see the replacement
print()
df.rename( {'Age':'Old'}, axis=1, inplace=True )

  Name  Age
0    a    1
1    b    2
2    c    3
3    d    4
4    e    5
5    f    6

  Newer-Name  Age
0          a    1
1          b    2
2          c    3
3          d    4
4          e    5
5          f    6

In [16]:
imdb=pd.read_csv('C:/Users/Public.DESKTOP-6RBQT7L/Desktop/Programming - Maths/SPACY IITians course/C01L09- Chug Data, Spit Frames/data/train.csv'
,sep=',') #header=None,names=cols

imdb.info()

type(imdb['id'])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 23 columns):
id                       3000 non-null int64
belongs_to_collection    604 non-null object
budget                   3000 non-null int64
genres                   2993 non-null object
homepage                 946 non-null object
imdb_id                  3000 non-null object
original_language        3000 non-null object
original_title           3000 non-null object
overview                 2992 non-null object
popularity               3000 non-null float64
poster_path              2999 non-null object
production_companies     2844 non-null object
production_countries     2945 non-null object
release_date             3000 non-null object
runtime                  2998 non-null float64
spoken_languages         2980 non-null object
status                   3000 non-null object
tagline                  2403 non-null object
title                    3000 non-null object
Keywords                 2724 non-null object
cast                     2987 non-null object
crew                     2984 non-null object
revenue                  3000 non-null int64
dtypes: float64(2), int64(3), object(18)
memory usage: 539.1+ KB

pandas.core.series.Series

In [17]:
data_info = pd.read_excel('C:/Users/Public.DESKTOP-6RBQT7L/Desktop/Programming - Maths/SPACY IITians course/C01L09- Chug Data, Spit Frames/data/data_info.xlsx', sheet_name='merchant'
,sep=',')

data_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 2 columns):
Columns        22 non-null object
Description    22 non-null object
dtypes: object(2)
memory usage: 432.0+ bytes

In [18]:
students = pd.read_json("C:/Users/Public.DESKTOP-6RBQT7L/Desktop/Programming - Maths/SPACY IITians course/C01L09- Chug Data, Spit Frames/data/students.json",lines= True)

students.info()

type(students)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 5 columns):
_id         11 non-null int64
exam        11 non-null float64
homework    11 non-null float64
name        11 non-null object
quiz        11 non-null int64
dtypes: float64(2), int64(2), object(1)
memory usage: 520.0+ bytes

pandas.core.frame.DataFrame

In [19]:
students.to_pickle("C:/Users/Public.DESKTOP-6RBQT7L/Desktop/Programming - Maths/SPACY IITians course/C01L09- Chug Data, Spit Frames/data/students.pkl")

students_pickle=pd.read_pickle("C:/Users/Public.DESKTOP-6RBQT7L/Desktop/Programming - Maths/SPACY IITians course/C01L09- Chug Data, Spit Frames/data/students.pkl")

print(students_pickle)

    _id  exam    homework              name  quiz
0     0   1.5   35.874035        aimee Zank    12
1     1   2.8   36.000000  Aurelia Menendez    15
2     2   3.5   40.000000       Corliss Zuk    10
3     3   3.6   49.000000        Bao Ziglar    20
4     4   3.7   54.000000  Zachary Langlais    20
5     5   4.9   96.000000    Wilburn Spiess    19
6     6   4.8  100.000000  Jenette Flanders    16
7     7   3.2   54.000000      Salena Olmos    17
8     8   3.1   43.000000      Daphne Zheng    13
9     9   4.6   90.000000        Sanda Ryba    19
10   10   3.9   67.000000      Denisha Cast    18

In [20]:
df1=pd.read_csv('C:/Users/Public.DESKTOP-6RBQT7L/Desktop/Programming - Maths/SPACY IITians course/C01L10- Theatrics with dataframe//data/phone_data.csv',sep=',')

print(df1.head())
print(df1.describe())
print("------------------------------")
print()
print(df1['month'].head()) # display only selected columns
print()
print(df1.month.head()) # display only selected columns
print()
print(df1[['month','date']].head()) # display multiple selected columns
print("------------------------------")
print()
print(df1['network'][2])

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile
            index      duration
count  830.000000    830.000000
mean   414.500000    117.804036
std    239.744656    444.129560
min      0.000000      1.000000
25%    207.250000      1.000000
50%    414.500000     24.500000
75%    621.750000     55.000000
max    829.000000  10528.000000
------------------------------

0    2014-11
1    2014-11
2    2014-11
3    2014-11
4    2014-11
Name: month, dtype: object

0    2014-11
1    2014-11
2    2014-11
3    2014-11
4    2014-11
Name: month, dtype: object

     month            date
0  2014-11  15/10/14 06:58
1  2014-11  15/10/14 06:58
2  2014-11  15/10/14 14:46
3  2014-11  15/10/14 14:48
4  2014-11  15/10/14 17:27
------------------------------

Meteor

In [21]:
print(df1.loc[2:12:2,['item','duration','network']]) # here the to-number after ":" is inclusive unlike other places in python, numpy, pandas etc.
# df.loc - works on column names, mandatory to know them
print("*****************************")
print(df1.iloc[2:12:2,0:3])
# df.iloc - works on column number, hence no column names are required

    item  duration network
2   call    23.000  Meteor
4   call     4.000   Tesco
6   data    34.429    data
8   call  1050.000   Three
10  call  1183.000   Three
12   sms     1.000  Meteor
*****************************
    index            date  duration
2       2  15/10/14 14:46    23.000
4       4  15/10/14 17:27     4.000
6       6  16/10/14 06:58    34.429
8       8  16/10/14 15:12  1050.000
10     10  16/10/14 16:21  1183.000

In [22]:
df1=pd.read_csv('C:/Users/Public.DESKTOP-6RBQT7L/Desktop/Programming - Maths/SPACY IITians course/C01L10- Theatrics with dataframe//data/phone_data.csv',sep=',')
# Boolean Index
condition = (df1.item == 'call') & (df1.network == 'Tesco')
print(df1[condition].head())
print()
print(df1[~condition].head())
print("-----------------------------------")
print("\nAdding columns:\n")
df1['new column']=df1['duration']*2 # adds a new  column based on calculations on existing columns
print(df1.head())
print("--------------------------")
print("\nDropping columns:\n")
df1.drop(['month','index'],axis=1,inplace=True)
print(df1.head())

    index            date  duration  item    month network network_type
3       3  15/10/14 14:48       4.0  call  2014-11   Tesco       mobile
4       4  15/10/14 17:27       4.0  call  2014-11   Tesco       mobile
5       5  15/10/14 18:55       4.0  call  2014-11   Tesco       mobile
21     21  17/10/14 17:30     375.0  call  2014-11   Tesco       mobile
27     27  18/10/14 11:51     783.0  call  2014-11   Tesco       mobile

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
6      6  16/10/14 06:58    34.429  data  2014-11      data         data
7      7  16/10/14 15:01   602.000  call  2014-11     Three       mobile
-----------------------------------

Adding columns:

   index            date  duration  item    month   network network_type  \
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

   new column
0      68.858
1      26.000
2      46.000
3       8.000
4       8.000
--------------------------

Dropping columns:

             date  duration  item   network network_type  new column
0  15/10/14 06:58    34.429  data      data         data      68.858
1  15/10/14 06:58    13.000  call  Vodafone       mobile      26.000
2  15/10/14 14:46    23.000  call    Meteor       mobile      46.000
3  15/10/14 14:48     4.000  call     Tesco       mobile       8.000
4  15/10/14 17:27     4.000  call     Tesco       mobile       8.000

In [23]:
# lambda function - Row wise operation
def new_comment(network):
    if network == 'Tesco':
        new_comment = "Paagal hai kya"
    else:
        new_comment = "Sahi hai beta"
    
    return new_comment


df1['new_comment'] = df1.apply(lambda x: new_comment(x['network']), axis=1)
print(df1.head())

             date  duration  item   network network_type  new column  \
0  15/10/14 06:58    34.429  data      data         data      68.858
1  15/10/14 06:58    13.000  call  Vodafone       mobile      26.000
2  15/10/14 14:46    23.000  call    Meteor       mobile      46.000
3  15/10/14 14:48     4.000  call     Tesco       mobile       8.000
4  15/10/14 17:27     4.000  call     Tesco       mobile       8.000

      new_comment
0   Sahi hai beta
1   Sahi hai beta
2   Sahi hai beta
3  Paagal hai kya
4  Paagal hai kya

In [24]:
df1.sort_values('duration', ascending=True)[0:7]

,date,duration,item,network,network_type,new column,new_comment
829,14/03/15 00:16,1.0,sms,world,world,2.0,Sahi hai beta
247,18/11/14 08:45,1.0,sms,Vodafone,mobile,2.0,Sahi hai beta
246,18/11/14 08:42,1.0,sms,Vodafone,mobile,2.0,Sahi hai beta
245,18/11/14 08:39,1.0,sms,Vodafone,mobile,2.0,Sahi hai beta
244,18/11/14 08:34,1.0,sms,Vodafone,mobile,2.0,Sahi hai beta
243,18/11/14 08:34,1.0,sms,Vodafone,mobile,2.0,Sahi hai beta
242,18/11/14 08:33,1.0,sms,Vodafone,mobile,2.0,Sahi hai beta

In [25]:
df1.sort_values(['duration','network'], ascending=[False,False]).head()

,date,duration,item,network,network_type,new column,new_comment
816,04/03/15 12:29,10528.0,call,landline,landline,21056.0,Sahi hai beta
742,17/02/15 19:09,2328.0,call,Three,mobile,4656.0,Sahi hai beta
252,19/11/14 18:56,2120.0,call,Three,mobile,4240.0,Sahi hai beta
59,23/10/14 08:34,1940.0,call,landline,landline,3880.0,Sahi hai beta
648,25/01/15 16:55,1863.0,call,Three,mobile,3726.0,Sahi hai beta

In [26]:
from datetime import datetime
from datetime import date
df1['new_date']=[datetime.strptime(x,'%d/%m/%y %H:%M') for x in df1['date']]
print(df1.head())
print("--------------")
print(df1['new_date'][0].month)
print(df1['new_date'][0].year)
print(df1['new_date'][0].day)
print(df1['new_date'][0].hour)
print(df1['new_date'][0].minute)
print("--------------")
print(date.today())
print(datetime.now())

             date  duration  item   network network_type  new column  \
0  15/10/14 06:58    34.429  data      data         data      68.858
1  15/10/14 06:58    13.000  call  Vodafone       mobile      26.000
2  15/10/14 14:46    23.000  call    Meteor       mobile      46.000
3  15/10/14 14:48     4.000  call     Tesco       mobile       8.000
4  15/10/14 17:27     4.000  call     Tesco       mobile       8.000

      new_comment            new_date
0   Sahi hai beta 2014-10-15 06:58:00
1   Sahi hai beta 2014-10-15 06:58:00
2   Sahi hai beta 2014-10-15 14:46:00
3  Paagal hai kya 2014-10-15 14:48:00
4  Paagal hai kya 2014-10-15 17:27:00
--------------
10
2014
15
6
58
--------------
2019-10-05
2019-10-05 16:52:16.003221

In [27]:
#Operations
from datetime import timedelta
print(date.today() - timedelta(days=1))
print(datetime.now() + timedelta(hours=1))
print(datetime.now() + timedelta(seconds=60))

2019-10-04
2019-10-05 17:52:16.038131
2019-10-05 16:53:16.038131